Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: OnceAction is typically relevant only when supporting move-only types or actions that want a type-system guarantee that they will be called at most once.
it_it: OnceAction è in genere rilevante solo quando si supportano tipi o azioni move-only che richiedono che un type-system garantisca che verranno chiamati al massimo una volta.

source: Listing 13 shows what a fixture class looks like.
it_it: Il Listato 13 mostra come appare una classe fixture.

source: Listing 3 is the code for the main routine that runs the test.
it_it: Il Listato 3 è il codice per la routine principale che esegue il test.

source: Listing 4 shows the output.
it_it: Il Listato 4 mostra l'output.

source: Listing 11 uses ASSERT_EXIT to verify such a scenario.
it_it: Il Listato 11 usa ASSERT_EXIT per verificare tale scenario.

source: Listing 2 shows that test case.
it_it: Il Listato 2 mostra questo caso di test.

source: Listing 6 demonstrates what you need to do if you want to disable the PositiveNos test from Listing 2.
it_it: Il Listiato 6 mostra cosa fare per disabilitare il test PositiveNos dal Listato 2.

source: Listing 8 shows the output when the DISABLE_PositiveNos test is run.
it_it: Il Listato 8 mostra l'output quando viene eseguito il test DISABLE_PositiveNos.

source: ASSERT_DEATH is simpler than ASSERT_EXIT; it just compares the error message in standard error with whatever is the user-expected message.
it_it: ASSERT_DEATH è più semplice di ASSERT_EXIT; confronta semplicemente il messaggio di errore nell'errore standard con qualunque sia il messaggio previsto dall'utente.

source: Listing 14 is an example that uses the fixture class.
it_it: Il Listato 14 è un esempio che utilizza la classe fixture.

source: RUN_ALL_TESTS must be called only once in the code because multiple calls to it conflict with some of the advanced features of the framework and, therefore, are not supported.
it_it: RUN_ALL_TESTS deve essere chiamato una sola volta nel codice perché più chiamate ad esso entrano in conflitto con alcune delle funzionalità avanzate del framework e, pertanto, non sono supportate.

source: TEST is a predefined macro defined in gtest.h (available with the downloaded sources) that helps define this hierarchy.
it_it: TEST è una macro predefinita definita in gtest.h (disponibile con i sorgenti scaricati) che aiuta a definire questa gerarchia.

source: EXPECT_EQ and ASSERT_EQ are also macros—in the former case test execution continues even if there is a failure while in the latter case test execution aborts.
it_it: Anche EXPECT_EQ e ASSERT_EQ sono macro—nel primo caso l'esecuzione del test continua anche se si verifica un errore, mentre nel secondo caso l'esecuzione del test viene interrotta.

source: Listing 12 provides the prototypes for ASSERT_DEATH and ASSERT_EXIT.
it_it: Il Listato 12 fornisce i prototipi per ASSERT_DEATH e ASSERT_EXIT.

source: A Bazel workspace is a directory on your filesystem that you use to manage source files for the software you want to build.
it_it: Un workspace Bazel è una directory sul file system che si utilizza per gestire i file sorgenti per il software che si desideri creare.

source: A third call to my_mock.SetNumber(7) would then match expectation 1.
it_it: Una terza chiamata a my_mock.SetNumber(7) corrisponderebbe [match] quindi alla expectation 1.

source: A "multi-argument" matcher is just one that matches a tuple.
it_it: Un matcher"multi-argomento" è semplicemente quello che corrisponde a una tupla.

source: A "multi-argument" matcher is just one that matches a *tuple*.
it_it: Un matcher "multi-argomento" è semplicemente quello che corrisponde a una *tuple*.

source: A **matcher** matches a *single* argument.
it_it: Un **matcher** si abbina ad un *singolo* argomento.

source: A **mock object** implements the same interface as a real object (so it can be used as one), but lets you specify at run time how it will be used and what it should do (which methods will be called?
it_it: Un **oggetto mock** implementa la stessa interfaccia di un oggetto reale (quindi può essere utilizzato in sua vece), ma consente di specificare in fase di esecuzione come verrà utilizzato e cosa dovrebbe fare (quali metodi saranno chiamati?

source: A **nice mock** suppresses uninteresting call *warnings*.
it_it: Un **nice mock** sopprime i *warnings* sulle chiamate uninteresting.

source: A **strict mock** turns uninteresting call warnings into errors.
it_it: Un **strict mock** trasforma i warning sulle chiamate uninteresting in errori.

source: A *test program* can contain multiple test suites.
it_it: Un *test program* può contenere più test suite.

source: A *test suite* contains one or many tests.
it_it: Una *test suite* contiene uno o più test.

source: A Buzz object represents a snippet being posted.
it_it: Un oggetto Buzz rappresenta un frammento [snippet] pubblicato.

source: A matcher matches a single argument.
it_it: Un matcher si abbina ad un singolo argomento.

source: A mock object implements the same interface as a real object (so it can be used as one), but lets you specify at run time how it will be used and what it should do (which methods will be called?
it_it: Un oggetto mock implementa la stessa interfaccia di un oggetto reale (quindi può essere utilizzato in sua vece), ma consente di specificare in fase di esecuzione come verrà utilizzato e cosa dovrebbe fare (quali metodi saranno chiamati?

source: A nice mock suppresses uninteresting call warnings.
it_it: Un nice mock sopprime i warning sulle chiamate uninteresting.

source: A strict mock turns uninteresting call warnings into errors.
it_it: Un mock strict trasforma i warning sulle chiamate uninteresting in errori.

source: A test program can contain multiple test suites.
it_it: Un test program può contenere più test suite.

source: A test suite contains one or many tests.
it_it: Una test suite contiene uno o più test.

source: A Case for Mock Turtles
it_it: Un Caso per Tartarughe Mock

source: A [Bazel workspace](https://docs.bazel.build/versions/main/build-ref.html#workspace) is a directory on your filesystem that you use to manage source files for the software you want to build.
it_it: Un [workspace Bazel](https://docs.bazel.build/versions/main/build-ref.html#workspace) è una directory sul file system che si utilizza per gestire i file sorgenti per il software che si desideri creare.

source: A `Buzz` object represents a snippet being posted.
it_it: Un oggetto `Buzz` rappresenta un frammento [snippet] pubblicato.

source: A better solution is to use the SCOPED_TRACE macro or the ScopedTrace utility:
it_it: Una soluzione migliore è quella di utilizzare la macro SCOPED_TRACE o l'utility ScopedTrace:

source: A better solution is to use the `SCOPED_TRACE` macro or the `ScopedTrace` utility:
it_it: Una soluzione migliore è quella di utilizzare la macro `SCOPED_TRACE` o l'utility `ScopedTrace`:

source: A better way is to use gMock actions and Notification objects to force your asynchronous test to behave synchronously.
it_it: Un modo migliore è quello di utilizzare le azioni gMock e gli oggetti Notification per forzare il test asincrono a comportarsi in modo sincrono.

source: A better way is to use gMock actions and `Notification` objects to force your asynchronous test to behave synchronously.
it_it: Un modo migliore è quello di utilizzare le azioni gMock e gli oggetti `Notification` per forzare il test asincrono a comportarsi in modo sincrono.

source: A built-in parameterized test name generator which returns the result of PrintToString called on info.param.
it_it: Un generatore nativo di nomi di test con parametri che restituisce il risultato di PrintToString chiamato su info.param.

source: A built-in parameterized test name generator which returns the result of [`PrintToString`](#PrintToString) called on `info.param`.
it_it: Un generatore nativo di nomi di test con parametri che restituisce il risultato di [`PrintToString`](#PrintToString) chiamato su `info.param`.

source: A call x.Y(...) is unexpected if there are some EXPECT_CALL(x, Y(...))s set, but none of them matches the call.
it_it: Una chiamata x.Y(...) è unexpected se è impostata qualche EXPECT_CALL(x, Y(...)), ma nessuna di esse corrisponde [match] alla chiamata.

source: A call x.Y(...) is uninteresting if there's not even a single EXPECT_CALL(x, Y(...)) set.
it_it: Una chiamata x.Y(...) è uninteresting se non è impostata nemmeno una singola EXPECT_CALL(x, Y(...)).

source: A call `x.Y(...)` is **unexpected** if there are *some* `EXPECT_CALL(x, Y(...))`s set, but none of them matches the call.
it_it: Una chiamata `x.Y(...)` è **unexpected** se è impostata *qualche* `EXPECT_CALL(x, Y(...))`, ma nessuna di esse corrisponde [match] alla chiamata.

source: A call `x.Y(...)` is **uninteresting** if there's *not even a single* `EXPECT_CALL(x, Y(...))` set.
it_it: Una chiamata `x.Y(...)` è **uninteresting** se non è impostata *nemmeno una singola* `EXPECT_CALL(x, Y(...))`.

source: A call to foo.Bar() that doesn't match any of the EXPECT_CALL() statements will be an error.
it_it: Una chiamata a foo.Bar() che non corrisponde a nessuna delle istruzioni EXPECT_CALL() sarà un errore.

source: A call to `foo.Bar()` that doesn't match any of the `EXPECT_CALL()` statements will be an error.
it_it: Una chiamata a `foo.Bar()` che non corrisponde a nessuna delle istruzioni `EXPECT_CALL()` sarà un errore.

source: A cardinality is used in Times() to tell gMock how many times you expect a call to occur.
it_it: Una cardinalità viene utilizzata in Times() per dire a gMock quante volte ci si aspetta che avvenga una chiamata.

source: A cardinality is used in `Times()` to tell gMock how many times you expect a call to occur.
it_it: Una cardinalità viene utilizzata in `Times()` per dire a gMock quante volte ci si aspetta che avvenga una chiamata.

source: A class for indicating whether an assertion was successful.
it_it: Una classe per indicare se un'asserzione ha avuto successo.

source: A class that implements the Buzzer interface is capable of creating and sharing Buzzes.
it_it: Una classe che implementa l'interfaccia Buzzer è in grado di creare e condividere dei Buzz.

source: A class that implements the `Buzzer` interface is capable of creating and sharing `Buzz`es.
it_it: Una classe che implementa l'interfaccia `Buzzer` è in grado di creare e condividere dei `Buzz`.

source: A common and recommended way to depend on GoogleTest is to use a Bazel external dependency via the http_archive rule.
it_it: Un modo comune e consigliato per dipendere da GoogleTest è quello di utilizzare una Bazel external dependency tramite la regola http_archive.

source: A common and recommended way to depend on GoogleTest is to use a [Bazel external dependency](https://docs.bazel.build/versions/main/external.html) via the [`http_archive` rule](https://docs.bazel.build/versions/main/repo/http.html#http_archive).
it_it: Un modo comune e consigliato per dipendere da GoogleTest è quello di utilizzare una [Bazel external dependency](https://docs.bazel.build/versions/main/external.html) tramite la [regola `http_archive`](https://docs.bazel.build/versions/main/repo/http.html#http_archive).

source: A common mistake is to spell SetUp() as Setup() with a small u - Use override in C++11 to make sure you spelled it correctly.
it_it: Un errore comune è scrivere SetUp() come Setup() con una u minuscola - Usare override in C++11 per essere sicuri di scriverlo correttamente.

source: A common mistake is to spell `SetUp()` as **`Setup()`** with a small `u` - Use `override` in C++11 to make sure you spelled it correctly.
it_it: Un errore comune è scrivere `SetUp()` come **`Setup()`** con una `u` minuscola - Usare `override` in C++11 per essere sicuri di scriverlo correttamente.

source: A common pitfall when using ASSERT_* and FAIL* is not understanding that when they fail they only abort the current function, not the entire test.
it_it: Un errore comune quando si utilizzano ASSERT_* e FAIL* è non capire che quando falliscono interrompono solo la funzione corrente, non l'intero test.

source: A common pitfall when using `ASSERT_*` and `FAIL*` is not understanding that when they fail they only abort the _current function_, not the entire test.
it_it: Un errore comune quando si utilizzano `ASSERT_*` e `FAIL*` è non capire che quando falliscono interrompono solo la _funzione corrente_, non l'intero test.

source: A compatible C++ compiler that supports at least C++14.
it_it: Un compilatore C++ compatibile che supporti almeno C++14.

source: A compatible object is any that supports the std::tuple_size<Obj>+get<I>(obj) protocol.
it_it: Un oggetto compatibile è qualsiasi oggetto che supporti il protocollo std::tuple_size<Obj>+get<I>(obj).

source: A compatible object is any that supports the `std::tuple_size<Obj>`+`get<I>(obj)` protocol.
it_it: Un oggetto compatibile è qualsiasi oggetto che supporti il protocollo `std::tuple_size<Obj>`+`get<I>(obj)`.

source: A compatible operating system (e.g. Linux, macOS, Windows).
it_it: Un sistema operativo compatibile (ad esempio Linux, macOS, Windows).

source: A convenience class which inherits from both Test and WithParamInterface<T>.
it_it: Una classe di convenienza che eredita sia da Test che da WithParamInterface<T>.

source: A convenience class which inherits from both [`Test`](#Test) and [`WithParamInterface<T>`](#WithParamInterface).
it_it: Una classe di convenienza che eredita sia da [`Test`](#Test) che da [`WithParamInterface<T>`](#WithParamInterface).

source: A copyable object representing a user-specified test property which can be output as a key/value string pair.
it_it: Un oggetto copiabile che rappresenta una proprietà di test specificata dall'utente che può essere restituita come coppia di stringhe chiave/valore.

source: A copyable object representing the result of a test part (i.e. an assertion or an explicit FAIL(), ADD_FAILURE(), or SUCCESS()).
it_it: Un oggetto copiabile che rappresenta il risultato di una parte di test (ovvero un'asserzione o un FAIL(), ADD_FAILURE() o SUCCESS() esplicito).

source: A copyable object representing the result of a test part (i.e. an assertion or an explicit `FAIL()`, `ADD_FAILURE()`, or `SUCCESS()`).
it_it: Un oggetto copiabile che rappresenta il risultato di una parte di test (ovvero un'asserzione o un `FAIL()`, `ADD_FAILURE()` o `SUCCESS()` esplicito).

source: A custom matcher allows you to test a specific invariant property of that object.
it_it: Un matcher custom consente di testare una proprietà invariante specifica di quell'oggetto.

source: A few actions (e.g. DoAll) copy their arguments internally, so they can never work with non-copyable objects; you'll have to use functors instead.
it_it: Alcune azioni (ad esempio DoAll) copiano i loro argomenti internamente, quindi non possono mai funzionare con oggetti non copiabili; si dovranno usare invece i funtori.

source: A few actions (e.g. `DoAll`) copy their arguments internally, so they can never work with non-copyable objects; you'll have to use functors instead.
it_it: Alcune azioni (ad esempio `DoAll`) copiano i loro argomenti internamente, quindi non possono mai funzionare con oggetti non copiabili; si dovranno usare invece i funtori.

source: A frequently used matcher is _, which matches anything:
it_it: Un matcher usato spesso è _, che corrisponde a qualsiasi cosa:

source: A frequently used matcher is `_`, which matches anything:
it_it: Un matcher usato spesso è `_`, che corrisponde a qualsiasi cosa:

source: A listener that handles OnTestPartResult() is not allowed to generate any failure.
it_it: Un listener che gestisce OnTestPartResult() non può generare alcun errore.

source: A listener that handles `OnTestPartResult()` is not allowed to generate any failure.
it_it: Un listener che gestisce `OnTestPartResult()` non può generare alcun errore.

source: A matcher is like a predicate and can test whether an argument is what we'd expect.
it_it: Un matcher è come un predicato e può verificare se un argomento è quello che ci aspetteremmo.

source: A matcher of T must declare a typedef like:
it_it: Un matcher di T deve dichiarare un typedef come:

source: A matcher of `T` must declare a typedef like:
it_it: Un matcher di `T` deve dichiarare un typedef come:

source: A matcher of argument type T implements the matcher interface for T and does two things: it tests whether a value of type T matches the matcher, and can describe what kind of values it matches.
it_it: Un matcher di tipo argomento T implementa l'interfaccia del matcher per T e fa due cose: verifica se un valore di tipo T corrisponde al matcher, e può descrivere il tipo di valori a cui corrisponde.

source: A matcher of argument type `T` implements the matcher interface for `T` and does two things: it tests whether a value of type `T` matches the matcher, and can describe what kind of values it matches.
it_it: Un matcher di tipo argomento `T` implementa l'interfaccia del matcher per `T` e fa due cose: verifica se un valore di tipo `T` corrisponde al matcher, e può descrivere il tipo di valori a cui corrisponde.

source: A mock object may have many methods, and not all of them are that interesting.
it_it: Un oggetto mock può avere molti metodi e non tutti sono così interessanti.

source: A move-only-typed value can be moved from one object to another, but cannot be copied.
it_it: Un valore "move-only-typed" può essere spostato da un oggetto a un altro, ma non può essere copiato.

source: A pattern may contain '*' (matches any string) or '?' (matches any single character).
it_it: Un pattern può contenere '*' (corrisponde a qualsiasi stringa) or'?' (corrisponde a qualsiasi carattere singolo).

source: A pattern may contain `'*'` (matches any string) or `'?'` (matches any single character).
it_it: Un pattern può contenere `'*'` (corrispondente a qualsiasi stringa) o `'?'` (corrispondente a qualsiasi carattere singolo).

source: A quick introduction to the Google C++ Testing Framework
it_it: Una rapida introduzione al Google C++ Testing Framework

source: A technique you can use is to put the expectations in a sequence and insert calls to a dummy "checkpoint" function at specific places.
it_it: Una tecnica utilizzabile è quella di mettere le expectation in una sequenza e inserire chiamate a una funzione fittizia di "checkpoint" in punti specifici.

source: A test fixture class
it_it: Una classe fixture

source: A test is considered successful only if none of its assertions fail during its execution.
it_it: Un test è considerato riuscito solo se nessuna delle sue asserzioni fallisce durante la sua esecuzione.

source: A test matches the filter if and only if it matches any of the positive patterns but does not match any of the negative patterns.
it_it: Un test corrisponde al filtro se e solo se corrisponde a uno qualsiasi dei pattern positivi ma non corrisponde a nessuno dei pattern negativi.

source: A test suite for this function might look like:
it_it: Una test suite per questa funzione potrebbe essere simile a:

source: A test's *full name* consists of its containing test suite and its individual name.
it_it: Il *nome completo* di un test è costituito dalla test suite che lo contiene e dal suo nome individuale.

source: A test's full name consists of its containing test suite and its individual name.
it_it: Il nome completo di un test è costituito dalla test suite che lo contiene e dal suo nome individuale.

source: A third call to `my_mock.SetNumber(7)` would then match expectation 1.
it_it: Una terza chiamata a `my_mock.SetNumber(7)` corrisponderebbe [match] quindi alla expectation 1.

source: A value-parameterized test fixture class must inherit from both Test and WithParamInterface.
it_it: Una classe fixture con valori parametrizzati deve ereditare sia da Test che da WithParamInterface.

source: A value-parameterized test fixture class must inherit from both [`Test`](#Test) and `WithParamInterface`.
it_it: Una classe fixture con valori parametrizzati deve ereditare sia da [`Test`](#Test) che da `WithParamInterface`.

source: A warning is emitted if multiple threads are running when a death test is encountered.
it_it: Viene emesso un warning se sono in esecuzione più thread quando viene riscontrato un death test.

source: ACTION(name) { statements; }
it_it: ACTION(nome) { istruzioni; }

source: ASSERT_DEATH(Xyz(5), "Xyz failed"); } // Or a complex expression that references variables and functions.
it_it: ASSERT_DEATH(Xyz(5), "Xyz failed"); } // O un'espressione complessa che fa riferimento a variabili e funzioni.

source: ASSERT_EXIT checks if the function is exiting with a proper exit code (that is, the argument to exit or _exit routines) and compares the string within quotes to whatever the function prints to standard error.
it_it: ASSERT_EXIT controlla se la funzione sta uscendo con un codice corretto (ovvero, l'argomento delle routine exit o _exit) e confronta la stringa tra virgolette a qualunque cosa la funzione stampi in errore standard.

source: According to 'man htonl', htonl() is a function, which means it's valid to use htonl as a function pointer.
it_it: Secondo 'man htonl', htonl() è una funzione, il che significa che è corretto utilizzare htonl come puntatore a funzione.

source: According to `'man htonl'`, `htonl()` is a *function*, which means it's valid to use `htonl` as a function pointer.
it_it: Secondo `'man htonl'`, `htonl()` è una *funzione*, il che significa che è corretto utilizzare `htonl` come puntatore a funzione.

source: Across all shards, each test function in the program will be run exactly once.
it_it: In tutti gli shard, ciascuna funzione di test nel programma verrà eseguita esattamente una volta.

source: Actions
it_it: Le Azioni

source: Actions Reference
it_it: Riferimenti alle Action

source: Actions {#ActionList}
it_it: Le Action {#ActionList}

source: Actions: What Should It Do?
it_it: Azioni: Cosa Dovrebbe Fare?

source: Actually, the bug is in htonl().
it_it: In realtà il bug è in htonl().

source: Actually, the bug is in `htonl()`.
it_it: In realtà il bug è in `htonl()`.

source: Adapters for Matchers
it_it: Adattatori per i Matcher

source: Adding Traces to Assertions
it_it: Aggiungere Trace alle Asserzioni

source: Additionally, by default, every TEST_P without a corresponding INSTANTIATE_TEST_SUITE_P causes a failing test in test suite GoogleTestVerification.
it_it: Inoltre, per default, ogni TEST_P senza un corrispondente INSTANTIATE_TEST_SUITE_P provoca un test non riuscito nella test suite GoogleTestVerification.

source: Additionally, by default, every `TEST_P` without a corresponding `INSTANTIATE_TEST_SUITE_P` causes a failing test in test suite `GoogleTestVerification`.
it_it: Inoltre, per default, ogni `TEST_P` senza un corrispondente `INSTANTIATE_TEST_SUITE_P` provoca un test non riuscito nella test suite `GoogleTestVerification`.

source: Adds a test environment to the test program.
it_it: Aggiunge un ambiente di test al programma di test.

source: Admittedly, this is a hack.
it_it: Certo, questo è un trucco.

source: Admittedly, this test is contrived and doesn't do much.
it_it: Certo, questo test è artificioso e non fa molto.

source: Advanced GoogleTest Topics
it_it: Argomenti avanzati di GoogleTest

source: Advanced Topics
it_it: Argomenti Avanzati

source: After #including this header, you can use
it_it: Dopo lo #include di questo header, si può usare

source: After compiling your project with one of the sanitizers enabled, if a particular test triggers a sanitizer error, GoogleTest will report that it failed.
it_it: Dopo aver compilato il progetto con uno dei sanitizer abilitati, se un particolare test attiva un errore del sanitizer, GoogleTest segnalerà che non è riuscito.
